&НаКлиенте
Процедура КоличествоСовпадений(Команда)
	КоличествоСовпаденийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Совпадает(Команда)
	СовпадаетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СовпадаетНаСервере()
	Сообщить(РВ_РегулярныеВыраженияКлиентСервер.Совпадает(ТекстАнализа, РегулярноеВыражение, ВсеСовпадения,
		ИгнорироватьРегистр));
КонецПроцедуры

&НаКлиенте
Процедура СовпадаетАсинхронно(Команда)
	РВ_РегулярныеВыраженияКлиентСервер.НачатьПолучениеПризнакаСовпадает(
		Новый ОписаниеОповещения("СовпадаетАсинхронноЗавершение", ЭтотОбъект), ТекстАнализа, РегулярноеВыражение,
		ВсеСовпадения, ИгнорироватьРегистр);
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	ЗаменитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаСервере()
	Сообщить(РВ_РегулярныеВыраженияКлиентСервер.Заменить(ТекстАнализа, РегулярноеВыражение, СтрокаЗамены, ВсеСовпадения,
		ИгнорироватьРегистр));
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьАсинхронно(Команда)
	РВ_РегулярныеВыраженияКлиентСервер.НачатьЗамену(
		Новый ОписаниеОповещения("ЗаменитьАсинхронноЗавершение", ЭтотОбъект), ТекстАнализа, РегулярноеВыражение,
		СтрокаЗамены, ВсеСовпадения, ИгнорироватьРегистр);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьАсинхронноЗавершение(Результат, Параметры, ДополнительныеПараметры) Экспорт
	Сообщить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура СовпадаетАсинхронноЗавершение(Результат, Параметры, ДополнительныеПараметры) Экспорт
	Сообщить(Результат);
КонецПроцедуры

&НаСервере
Процедура КоличествоСовпаденийНаСервере()
	Сообщить(РВ_РегулярныеВыраженияКлиентСервер.КоличествоСовпадений(ТекстАнализа, РегулярноеВыражение, ВсеСовпадения,
		ИгнорироватьРегистр));
КонецПроцедуры

&НаКлиенте
Процедура НайтиСовпадения(Команда)
	НайтиСовпаденияНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиСовпаденияНаСервере()
	Совпадения=РВ_РегулярныеВыраженияКлиентСервер.НайтиСовпадения(ТекстАнализа, РегулярноеВыражение,
		ИерархическихОбходРезультата, ВсеСовпадения, ИгнорироватьРегистр);

	Для Каждого КлючЗначение Из Совпадения Цикл
		Сообщить(КлючЗначение.Ключ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НайтиСовпаденияАсинхронно(Команда)
	РВ_РегулярныеВыраженияКлиентСервер.НачатьНахождениеСовпадений(
		Новый ОписаниеОповещения("НайтиСовпаденияАсинхронноЗавершение", ЭтотОбъект), ТекстАнализа, РегулярноеВыражение,
		ИерархическихОбходРезультата, ВсеСовпадения, ИгнорироватьРегистр);
КонецПроцедуры

&НаКлиенте
Процедура НайтиСовпаденияАсинхронноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Для Каждого КлючЗначение Из Результат Цикл
		Сообщить(КлючЗначение.Ключ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСовпаденийАсинхронно(Команда)
	РВ_РегулярныеВыраженияКлиентСервер.НачатьПолучениеКоличестваСовпадений(
		Новый ОписаниеОповещения("КоличествоСовпаденийАсинхронноЗавершение", ЭтотОбъект), ТекстАнализа,
		РегулярноеВыражение, ВсеСовпадения, ИгнорироватьРегистр, ИерархическихОбходРезультата);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСовпаденийАсинхронноЗавершение(Результат, Параметры, ДополнительныеПараметры) Экспорт
	Сообщить(Результат);
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстАнализа="Hello world";
	РегулярноеВыражение="([A-Za-z]+)\s+([a-z]+)";
	ВсеСовпадения=Истина;
	ИгнорироватьРегистр=Истина;
КонецПроцедуры